# ContextualHelp Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ContextualHelp Constructor
ContextualHelp Class See Also
---
Constructs a contextual help object.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ContextualHelp(
	ContextualHelpType helpType,
	string helpPath
)
```

Visual Basic
---
```text
Public Sub New ( _
	helpType As ContextualHelpType, _
	helpPath As String _
)
```

Visual C++
---
```text
public:
ContextualHelp(
	ContextualHelpType helpType,
	String^ helpPath
)
```

# ### Parameters
helpType
    Type: Autodesk.Revit.UI..::..ContextualHelpTypeThe contextual help type.
helpPath
    Type: System..::..StringThe contextual help path.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the helpPath is null or empty. |

# See Also
ContextualHelp Class
Autodesk.Revit.UI Namespace